###################################################################

# Created by write_sdc on Wed Jan 22 12:38:11 2020

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {PCtoIM[63]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[62]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[61]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[60]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[59]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[58]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[57]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[56]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[55]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[54]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[53]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[52]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[51]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[50]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[49]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[48]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[47]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[46]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[45]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[44]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[43]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[42]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[41]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[40]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[39]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[38]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[37]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[36]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[35]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[34]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[33]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[32]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[31]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[30]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[29]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[28]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[27]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[26]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[25]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[24]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[23]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[22]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[21]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[20]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[19]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[18]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[17]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[16]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[15]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[14]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[13]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[12]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[11]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[10]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[9]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[8]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[7]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[6]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[5]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[4]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[3]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[2]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[1]}]
set_load -pin_load 3.40189 [get_ports {PCtoIM[0]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[63]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[62]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[61]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[60]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[59]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[58]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[57]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[56]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[55]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[54]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[53]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[52]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[51]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[50]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[49]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[48]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[47]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[46]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[45]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[44]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[43]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[42]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[41]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[40]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[39]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[38]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[37]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[36]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[35]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[34]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[33]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[32]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[31]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[30]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[29]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[28]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[27]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[26]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[25]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[24]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[23]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[22]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[21]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[20]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[19]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[18]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[17]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[16]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[15]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[14]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[13]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[12]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[11]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[10]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[9]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[8]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[7]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[6]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[5]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[4]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[3]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[2]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[1]}]
set_load -pin_load 3.40189 [get_ports {ALUtoMEMORY[0]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[63]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[62]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[61]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[60]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[59]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[58]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[57]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[56]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[55]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[54]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[53]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[52]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[51]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[50]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[49]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[48]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[47]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[46]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[45]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[44]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[43]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[42]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[41]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[40]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[39]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[38]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[37]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[36]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[35]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[34]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[33]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[32]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[31]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[30]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[29]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[28]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[27]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[26]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[25]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[24]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[23]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[22]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[21]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[20]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[19]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[18]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[17]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[16]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[15]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[14]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[13]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[12]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[11]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[10]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[9]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[8]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[7]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[6]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[5]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[4]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[3]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[2]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[1]}]
set_load -pin_load 3.40189 [get_ports {OUT2RFtoMEMORY[0]}]
set_load -pin_load 3.40189 [get_ports memoryEnable]
set_load -pin_load 3.40189 [get_ports ReadNotWrite]
create_clock [get_ports Clk]  -name MY_CLK  -period 5.84  -waveform {0 2.92}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports Clk]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports Rst]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAMout[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[63]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[62]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[61]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[60]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[59]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[58]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[57]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[56]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[55]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[54]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[53]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[52]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[51]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[50]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[49]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[48]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[47]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[46]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[45]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[44]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCtoIM[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[63]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[62]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[61]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[60]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[59]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[58]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[57]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[56]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[55]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[54]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[53]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[52]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[51]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[50]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[49]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[48]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[47]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[46]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[45]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[44]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUtoMEMORY[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[63]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[62]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[61]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[60]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[59]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[58]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[57]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[56]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[55]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[54]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[53]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[52]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[51]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[50]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[49]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[48]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[47]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[46]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[45]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[44]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {OUT2RFtoMEMORY[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports memoryEnable]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports ReadNotWrite]
