read_verilog -netlist ./netlist/riscv.v
read_saif -input ./saif/RISCV_syn.saif -instance TB_RISCV/UUT -unit ns -scale 1
create_clock -name MY_CLK Clk

report_power > ./reports/power.txt
